/datum/modpack/weapons
	/// Строковое имя модпака. Используется для поиска других модпаков в init.
	name = "Weapons (Оружие) Return energy gun old, Return Combat Shotgun"
	/// Строковое описание для модпака. Может использоваться для списка глаголов модпака в качестве описания.
	desc = "Затрагивает баланс пушек. Добавляет оружие: Морита, ПП G36 (обычная и в вариации Интек).Этот мод возвращает energy gun старого образца."
	/// Строка с авторами этого модпака.
	author = "Mirag1993, Overteh, KOCMOHABT"

///**********************************************************************///
