/datum/modpack/_master_files
	name = "Master Files"
	desc = "Ты всегда должен помещать любые модульные переопределения иконок, звуков, кода и всего другого в эту папку. Она должна соответствовать структуре папки основного кода. // Например: code/modules/mob/living/living.dm → mods/_master_files/code/modules/mob/living/living.dm // Это сделано для того, чтобы было проще выяснить, что изменилось в основном файле, без необходимости поиска в определениях процедур. // Это также помогает предотвратить многократное ненужное переопределение модулями одной и той же процедуры."
	author = "SuhEugene"
