/datum/quirk/alcohol_tolerance
	name = "Алкогольная устойчивость"
	desc = "Вы медленнее пьянеете и испытываете меньше негативных эффектов от алкоголя."

/datum/quirk/apathetic
	name = "Апатичный"
	desc = "А вообще, честно говоря, я уже никому не верю и ничего не жду. Наверное, в таком месте это даже к лучшему."

/datum/quirk/asthma
	name = "Астма"
	desc = "Вы страдаете от астмы — воспалительного заболевания, из-за которого ваши дыхательные пути сужаются! Будьте осторожны рядом с дымом и раздражающими газами!"

/datum/mutation/human/dwarfism
	name = "Дварфизм"
	desc = "Мутация, которая считается причиной карликовости."

/datum/quirk/empath
	name = "Эмпат"
	desc = "Будь то шестое чувство или внимательное изучение языка тела, вам достаточно беглого взгляда на человека, чтобы понять, что он чувствует."

/datum/quirk/freerunning
	name = "Паркур"
	desc = "Вы мастер быстрых движений! Вы можете быстрее залезать на столы."

/datum/quirk/friendly
	name = "Дружелюбный"
	desc = "Вы обнимаетесь лучше всех, особенно когда вы в подходящем настроении."

/datum/quirk/light_step
	name = "Легкая походка"
	desc = "Вы ступаете мягко. Шаги и наступание на острые предметы становятся тише и менее болезненными. Кроме того, ваши руки и одежда не испачкаются, если вы наступите в кровь."

/datum/quirk/polyglot
	name = "Полиглот"
	desc = "Вы свободно говорите на четырех языках! <b><i>(+5 очков языков)</i></b>"

/datum/quirk/fan_rilena
	name = "Суперфанат RILENA"
	desc = "Вы преданный поклонник популярного веб-сериала RILENA: LMR. Вы получаете прибавку к настроению от плюшевых игрушек любимых персонажей и от ношения значка Ксейдера."

/datum/quirk/robust_metabolism
	name = "Крепкий желудок"
	desc = "Вы можете есть то, что в противном случае было бы крайне не вкусно, крайне не вкусно."

/datum/quirk/selfaware
	name = "Чувство тела"
	desc = "Вы отлично знаете свое тело и можете точно оценить степень тяжести своих ран."

/datum/quirk/trilingual
	name = "Лингвист"
	desc = "Вы свободно говорите на трех языках. <b><i>(+2 очка языков)</i></b>"

/datum/quirk/blindness
	name = "Слепота"
	desc = "Вы полностью слепы, и ничто не может это исправить."

/datum/quirk/congenital_analgesia
	name = "Врожденная анальгезия"
	desc = "Из-за редкого заболевания ты никогда не чувствовал боли. По крайней мере, физической. То расставание до сих пор причиняет боль."

/datum/quirk/deafness
	name = "Глухота"
	desc = "Вы неизлечимо глухи."

/datum/quirk/fast_metabolism
	name = "Быстрый метаболизм"
	desc = "У вас гораздо более быстрый метаболизм, чем у большинства, и поэтому вы быстрее чувствуете голод."

/datum/quirk/frail
	name = "Хрупкий"
	desc = "У вас кожа из бумаги и кости из стекла! Вы получаете ранения гораздо легче, чем большинство людей."

/datum/quirk/heavy_sleeper
	name = "Крепкий сон"
	desc = "Ты спишь как убитый! Где бы тебя ни усыпили или ни оглушили, тебе требуется чуть больше времени, чтобы прийти в себя."

/datum/quirk/monolingual
	name = "Одноязычный"
	desc = "Вы свободно говорите только на своем родном языке. (-2 очка языков)"

/datum/quirk/mute
	name = "Немота"
	desc = "По какой-то причине вы совершенно не способны говорить."

/datum/quirk/nearsighted
	name = "Близорукость"
	desc = "Без очков с диоптриями вы близоруки, но появляетесь в игре сразу с парой очков."

/datum/quirk/paraplegic
	name = "Параплегия"
	desc = "Ваши ноги не работают. Ничто и никогда это не исправит. Зато смотрите: бесплатная инвалидная коляска!"

/datum/quirk/pushover
	name = "Слабовольный"
	desc = "Ваш первый инстинкт - всегда позволять другим помыкать собой. Чтобы вырваться из захвата, потребуются сознательные усилия."

/datum/quirk/smoker
	name = "Курильщик"
	desc = "Иногда вам просто чертовски хочется покурить. Наверное, для лёгких это не очень полезно."

/datum/quirk/vegetarian
	name = "Вегетарианец"
	desc = "Идея поедания мяса кажется вам морально и физически отвратительной."

/datum/quirk/no_taste
	name = "Агевзия"
	desc = "Вы не чувствуете вкуса! Но ядовитая еда все равно вас отравит."

/datum/quirk/bad_touch
	name = "Недотрога"
	desc = "Вы не любите обнимашки. Вы бы предпочли, чтобы люди просто оставили вас в покое."

/datum/quirk/deviant_tastes
	name = "Специфичный вкус"
	desc = "Вам не нравится еда, которая нравится большинству людей, и вы находите вкусной то, что им не нравится."

/datum/quirk/electronic_voicebox
	name = "Электронный голосовой аппарат"
	desc = "Вместо набора голосовых связок из плоти и крови у вас внутри находится цифровой модуль"

/datum/quirk/gunslinger
	name = "Стрелок"
	desc = "Вы один из самых быстрых стрелков на Фронтире. Эти новомодные и сложные пушки вам не по душе. Пистолеты и полуавтоматические винтовки подходят вам больше, но револьверы - они буквально созданы для вас. Вы можете вести скоростную стрельбу с зажатым курком из револьверов одинарного действия, крутить любой револьвер и в совершенстве владеете лучшим оружием в истории. <b><i>(НЕ РЕКОМЕНДУЕТСЯ ДЛЯ НОВИЧКОВ. ТОЛЬКО ДЛЯ ОПЫТНЫХ ИГРОКОВ)</i></b>."

/datum/quirk/light_drinker
	name = "Слабый к алкоголю"
	desc = "Вы просто не умеете пить и пьянеете очень быстро."

/datum/quirk/monochromatic
	name = "Монохромазия"
	desc = "Вы страдаете полным дальтонизмом и воспринимаете практически весь мир в черных и белых тонах."

/datum/quirk/musician
	name = "Музыкант"
	desc = "Вы можете настраивать ручные музыкальные инструменты, чтобы играть мелодии, которые снимают некоторые негативные эффекты и успокаивают душу."

/datum/quirk/photographer
	name = "Фотограф"
	desc = "Вы повсюду носите с собой камеру и личный фотоальбом, а также можете быстрее делать снимки."

/datum/quirk/prosopagnosia
	name = "Прозопагнозия"
	desc = "У вас расстройство, из-за которого вы совершенно не способны распознавать лица."

/datum/quirk/scarred_eye
	name = "Поврежденный глаз"
	desc = "Несчастный случай в прошлом стоил вам одного глаза, зато у вас есть крутая глазная повязка. Аррр!"

/datum/quirk/bald
	name = "Лысина"
	desc = "У вас нет волос, и вы из-за этого очень комплексуете! Не снимайте парик или хотя бы прикрывайте голову."

// MARK: Наши квирки
/datum/quirk/fan_clown
	name = "Фанат клоунов"
	desc = "Вам нравятся клоунские выходки, и вы получаете прибавку к настроению, когда носите значок клоуна."

/datum/quirk/drunkhealing
	name = "Хмельная стойкость"
	desc = "Ничто так не поднимает дух, как хорошая выпивка. Находясь в состоянии опьянения, вы постепенно излечиваетесь от травм."

/datum/quirk/jolly
	name = "Весельчак"
	desc = "Иногда вы просто чувствуете себя счастливым без всякой на то причины."

/datum/quirk/fan_mime
	name = "Фанат мимов"
	desc = "Вам нравятся выходки мимов, и вы получаете прибавку к настроению, когда носите значок мима."

/datum/quirk/night_vision
	name = "Ночное зрение"
	desc = "В полной темноте вы видите немного четче, чем большинство людей."

/datum/quirk/quick_removal_of_handcuffs
	name = "Быстрое снятие наручников"
	desc = "Сокращает время снятия наручников до 17–30 секунд. Скрывает текст снятия наручников (он не отображается в чате или над головой персонажа)."

/datum/quirk/skittish
	name = "Пугливый"
	desc = "Вы можете спрятаться в случае опасности. Нажмите Ctrl-Shift-клик по закрытому шкафчику, чтобы запрыгнуть в него (при наличии доступа)."

/datum/quirk/voracious
	name = "Прожорливый"
	desc = "Ничто не встает между тобой и едой. Ты ешь быстрее и можешь объедаться вредной пищей! Быть толстым тебе вполне к лицу."

/datum/quirk/badback
	name = "Больная спина"
	desc = "Из-за плохой осанки рюкзаки и другие сумки никогда не сидят на вашей спине как надо. Впрочем, предметы с более равномерным весом сидят нормально."

/datum/quirk/blooddeficiency
	name = "Дефицит крови"
	desc = "Ваш организм не может производить достаточное количество крови для самообеспечения."

/datum/quirk/brainproblems
	name = "Опухоль мозга"
	desc = "У вас в голове есть «маленький друг», который медленно ее разрушает. Захватите с собой маннитол!"

/datum/quirk/depression
	name = "Депрессия"
	desc = "Иногда вы просто ненавидите жизнь."

/datum/quirk/hypersensitive
	name = "Гиперчувствительный"
	desc = "Как бы то ни было, кажется, что всё влияет на ваше настроение сильнее, чем должно."

/datum/quirk/snob
	name = "Сноб"
	desc = "Вы цените изысканные вещи. Если комната выглядит некрасиво, то находиться в ней просто не имеет смысла, не так ли?"

/datum/quirk/nyctophobia
	name = "Никтофобия"
	desc = "Сколько вы себя помните, вы всегда боялись темноты. Находясь в темноте без источника света, вы инстинктивно ведете себя осторожно и постоянно испытываете чувство ужаса."

/datum/quirk/nonviolent
	name = "Пацифист"
	desc = "Мысль о насилии вызывает у вас тошноту. Настолько, что вы физически не можете никому навредить."

/datum/quirk/poor_aim
	name = "Плохой прицел"
	desc = "Вы ужасно стреляете из оружия и не можете прицелиться по прямой, даже если от этого зависит ваша жизнь. О стрельбе с двух рук не может быть и речи."

/datum/quirk/insanity
	name = "Синдром диссоциации реальности"
	desc = "Вы страдаете от серьезного расстройства, которое вызывает очень яркие галлюцинации. Токсин Mindbreaker может подавлять его действие, к тому же у вас имеется иммунитет к галлюциногенным свойствам этого вещества <b><i>(это не разрешение на гриферство!)</i></b>."

/datum/quirk/social_anxiety
	name = "Социофобия"
	desc = "Общение с людьми дается вам очень тяжело, вы часто заикаетесь или вовсе впадаете в ступор."

/datum/quirk/unstable
	name = "Нестабильный"
	desc = "Из-за пережитых в прошлом потрясений вы не сможете восстановить рассудок, если потеряете его. Будьте очень осторожны со своим настроением!"

/datum/quirk/pineapple_liker
	name = "Любовь к ананасам"
	desc = "Вы получаете огромное удовольствие от плодов рода ананасовых. Вы просто не можете наесться этой сладостью!"

/datum/quirk/pineapple_hater
	name = "Ненависть к ананасам"
	desc = "Вы искренне ненавидите плоды рода ананасовых. Серьезно, как, черт возьми, кто-то может говорить, что это вкусно? И какой безумец вообще додумался класть это на пиццу!?"

/datum/quirk/family_heirloom
	name = "Семейная реликвия"
	desc = "Вы являетесь владельцем семейной реликвии, которая передается из поколения в поколение. Вы должны беречь ее!"
