/datum/mission/ruin/signaled/drill/mining_base
	name = "Возобновите Работу Участка"
	desc = "N+S Logistics потеряла связь с недавно основанной шахтёрской базой. По нашим расчётам, участок базы находится прямо под перспективной лёдо-водородной жилой. \
			Из-за проблем со связью мы так и не удостоверились в том, правдивы ли наши догадки. Отправьтесь на предписанный участок, найдите буровую установку и принесите нам результаты геологических исследований. \
			Если команда N+S всё ещё там, то сообщите им что их системы связи сломаны, а следующая поставка провизии будет через 3 недели."
	// value = 20000
	// mission_limit = 1
	// faction = list(
	// 	/datum/faction/nt/ns_logi,
	// )

/obj/item/drill_readout
	layer = 4.6
